mooovi/app/controllers/reviews_controller.rb

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 13 LIMIT 1
---
  def new
    @product = Product.find(params[:product_id])

INSERT INTO `reviews` (`rate`, `review`, `product_id`, `created_at`, `updated_at`, `user_id`) VALUES (1, 'ハイドリヒを撃て！僕はドラえもんです', 4, '2019-07-18 03:50:15', '2019-07-18 03:50:15', 3)
---
  def create
    Review.create(create_params)