pictweet/app/controllers/comments_controller.rb

INSERT INTO `comments` (`user_id`, `tweet_id`, `text`, `created_at`, `updated_at`) VALUES (3, 20, 'test', '2019-07-16 08:52:59', '2019-07-16 08:52:59')
---
  def create
    @comment = Comment.create(
      text:     comment_params[:text],
      tweet_id: comment_params[:tweet_id],
      user_id:  current_user.id)