pictweet/app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.includes(:user).page(params[:page]).per(5).order('created_at DESC')
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (3, 4)

  def create
    Tweet.create(
      image:   tweet_params[:image],
      text:    tweet_params[:text],
      user_id: current_user.id
      )
---
INSERT INTO `tweets` (`text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('33333！！', '', '2019-09-02 02:30:00', '2019-09-02 02:30:00', 5)

  def destroy
    tweet = Tweet.find(params[:id])
    # if tweet.user_id == current_user.id
    #   tweet.destroy
    # end
    tweet.destroy  if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 23 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 23

  def edit
    @tweet = Tweet.find(params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 20 LIMIT 1

  def update
    tweet = Tweet.find(params[:id])
    # if tweet.user_id == current_user.id
    #   tweet.update(tweet_params)
    # end
    tweet.update(tweet_params) if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 20 LIMIT 1
UPDATE `tweets` SET `text` = '編集', `updated_at` = '2019-07-16 07:57:07' WHERE `tweets`.`id` = 20

  def show
    @tweet    = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 23 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 20
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1