nekotter/app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT `tweets`.* FROM `tweets`

  def create
    Tweet.create(tweet_params)
---
INSERT INTO `tweets` (`text`, `created_at`, `updated_at`) VALUES ('テスト', '2019-07-14 06:18:45', '2019-07-14 06:18:45')